Revit 2027 API
BuiltInFailures.DesignOptionFailures.KingNeverInOption Property
 A selected "[Serf]" belongs to a "[King]" which cannot be added to an Option--it was not added to the Option Set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId KingNeverInOption { get; }
Public Shared ReadOnly Property KingNeverInOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ KingNeverInOption {
	FailureDefinitionId^ get ();
}
static member KingNeverInOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace